{
    "leerdoel1": {
        "id": 1,
        "naam": "Rule of least power",
        "wat": "Dit komt voort uit de Weekly Nerd van Kilian Valkhof. Het lijkt mij een uitstekend streven om dit zoveel mogelijk toe te passen. Wat ik hier ook uit wil halen is dat ik onderzoek doe naar HTML elementen om ervoor te zorgen dat ik de volle potentie uit de code kan halen.",
        "waarom": "Naast dat ik denk dat mijn code een stuk sterker ervan zal worden, en mijn kennis wordt verbreed, denk ik dat het ook om de mindset gaat. Gebruik de taal waarvoor het bedoeld is. Gebruik HTML waar HTML voor is geschreven, en niet een gare JS oplossing.",
        "hoe": "Ik wil dit leerdoel verwezenlijken door, nadat een concept is geschetst, onderzoek te gaan doen en een breakdown te maken van de code. Hierna HTML elementen gebruiken die ik onderzocht heb, en waarvoor ze bedoeld zijn.",
        "tevreden": "Ik ben tevreden wanneer ik de volle potentie uit HTML heb gehaald, met de juiste attributen. Dit zichtbaar is, en docenten het er overeens zijn dat dit het geval is."
    },
    "leerdoel2": {
        "id": 2,
        "naam": "Code architectuur",
        "wat": "Een van de punten waar ik nog veel progressie kan op kan maken is het goed nadenken over de code structuur. Vaak genoeg kom ik met verschillende ideeën over de structuur, maar ga uit eindelijk zonder echt goed nagedacht te hebben maar met een van die opties. Dat wil ik graag anders doen deze keer.",
        "waarom": "Structuur helpt zowel met een groot project, maar al helemaal in teamverband. Dit zorgt voor overzicht, duidelijkheid, en rust. Iets wat ik toch wel vaak mis bij mijn eigen opdrachten waar ik altijd opzoek ben naar waar ik een bepaald stukje code heb gelaten.",
        "hoe": "Voornamelijk door gebruik van mappenstructuren, en goed nagedacht te hebben of er daadwerkelijk meerdere bestanden nodig zijn, of dat sommige stukken code wel samen bij elkaar in één document gestopt kunnen worden. Te veel documenten zorgt namelijk ook weer voor een verlies aan overzicht.",
        "tevreden": "Ik ben tevreden wanneer ik een mappenstructuur heb gebruikt, waarin ik aan mezelf heb gemerkt dat ik het prettig vind, overzichtelijk kon bijhouden, en mijn team er geen last van heeft gehad. Zonder te veel documenten te scheiden voor eigenlijk geen reden."
    },
    "leerdoel3": {
        "id": 3,
        "naam": "Conceptualiseren",
        "wat": "Tot nu toe heb ik veel moeite gehad met een goed concept te bedenken, en ga ik veel te snel coderen, en met ideeën rond slingeren zonder echt goed nagedacht te hebben hoe het idee in elkaar steekt. Dit zorgt er vaak voor dat ik later in het project het altijd wat lastiger vind om doel gericht te coderen.",
        "waarom": "Concepten zullen mij zowel helpen met een overzichtelijk idee te hebben van wat ik wil met de functionaliteiten, als later in het proces helpen een goed eindpunt in te stellen. Vaak genoeg heb ik last met iets uitwerken, doordat ik geen duidelijk idee heb van wat ik eigenlijk nou wil, wat allemaa begint bij het conceptualiseren.",
        "hoe": "Ik wil lekker veel gaan schetsen op papier met pen, een overzicht hebben van wat er op de website moet, en dit concreet maken. Ook wil ik meerdere concepten zijn langsgelopen met mijn team, waardoor ik ook uit mijn eigen bubbel wordt getrokken en zo beter op mijn eigen concepten kan reflecteren.",
        "tevreden": "Ik ben tevreden wanneer ik uit strak concept heb uitgewerkt naar meerdere iteraties, en dit mij heeft geholpen van het beginpunt een duidelijke visie te hebben van wat ik ga doen en waarna ik aan het toe werken ben."
    }
}