[
{
        "id": "WAFS",
        "name": "Web Apps From Scratch",
        "description": "Ontwerp en bouw een persoonlijke website waarmee je jezelf voorstelt, waarmee je jouw startniveau overstijgt en waarmee je jouw doelen voor de minor presenteert.",
        "reflection": "WAFS was een spannend begin waar ik snel tegen mijzelf aan begon te lopen. Zowel op het gebied van conceptualiseren, als het gebied van CSS had ik veel ruimte voor vooruitgang. De nieuwste CSS techniek die ik gebruikte was 'scroll-driven animations'. Aan het eind werd mijn werk tentoongesteld als 'gefaald met experimenteren', iets waar ik me toen nog niet bewust van was, dat voornamelijk mijn trade merk ging worden in deze minor. Proberen, falen, proberen en nog eens falen. En alhoewel dit zowel frustrerend was, met soms als resultaat dat ik niet echt iets had om te laten zien, was het ook erg leerzaam."
    },
{
        "id": "CttR",
        "name": "CSS to the Rescue",
        "description": [
            "We find the web fascinating. In recent years, CSS has become a mature and powerful language (no longer a bottleneck - on the contrary). However, many of the (new) CSS features are not yet fully utilised. Some parts of the spec are unfairly (still) not embraced, while other parts are so new and/or complex that we may not have fully grasped the possibilities yet. It's your wonderful task to map out the uncharted territories of the CSS world.",
            "In this four-week course, you'll be experimenting with CSS techniques that are new (to you). You’ll create an innovative, experimental, and enjoyable experience - using only vanilla HTML and vanilla CSS (frameworks, preprocessors, libraries, and JavaScript are not allowed)."
        ],
        "reflection": "CSS to the Rescue, vond ik zeker een leuk vak. Wat me ergens wel wat verbaasd aangezien CSS zeker niet een van mijn sterkere kanten is. Alhoewel mijn concept opzich zelf best leuk was, en verder itereerde naar echt een geinig concept, was de totale uitwerking wat uit een. Naast nieuwe technieken gebruikt te hebben als animaties op een details element, 3D, fonts toevoegen, en voor het eerst echt met SVG's werken, was het voornamelijk het experimenteer gedeelte dat ik het leukst vond en het meest heb uitgehaald. Zelfs al was de gehele uitwerking matig was ik erg blij met mijn vooruitgang gedurende dit vak. Voornamelijk op het gebied van nieuwe CSS leren, en conceptualiseren. Leuke kleine ideeën die alleen niet altijd geweldig samen kwamen."
    },
 {
        "id": "BT",
        "name": "Browser Technologies",
        "description": "Belastingaangifte doen is een van de meest complexe taken die mensen moeten doen. Als eindopdracht ga je een officiële belasting-PDF omzetten naar een interactief en duidelijk web-formulier.",
        "reflection": "Browser Technologies was een vak bijna helemaal naar mijn hart. De semantische HTML schrijven, HTML uitputten tot al zijn attributen, nadenken over error states, interacties, en logica achter een formulier is iets wat ik snel erg leuk begon te vinden. Dat is ook het meeste wat ik eruit heb kunnen halen. HTML schrijven, maar ook heel veel Javascript schrijven. Iets wat ik voor het eerst in mijn studie echt deed, en langzaam begon te begrijpen, wat me hielp zelfverzekerder te worden. Javascript was opeens niet meer een groot vraagteken, maar ik wist waar ik kon beginnen, en wist waar ik naartoe wou werken. Javascript en semantisch HTML waren de grootste plus punten van dit vak, echter werd wel nog eens duidelijker dan mijn CSS niet sterk in elkaar zat. Ik zat veel rond te spelen met margins en paddings, en wist totaal niet wat ik moest doen. Dit is iets waar ik meer focus op had moeten leggen, gezien ik wist dat dit mijn zwakke plek is."
    },
{
        "id": "Hackathon",
        "name": "Hackathon",
        "description": [
"De opdracht bestaat uit 2 delen. In een team van 3 personen:",
 "Ontwerp en bouw een digitale loftuiting voor de vrouwen in tech die de wereld veranderen en/of veranderd hebben (gebruik daarbij de data uit de API).",
 "Doe onderzoek naar experimentele technieken en gebruik er twee of meer zodat de loftuiting als showcase voor die technieken gebruikt kan worden."
        ],
        "reflection": "De Hackathon was een van de leukste vakken uit de gehele minor naar mijn mening. In korte tijd, samen als groep iets opleveren was erg gezellig en uitdagend. Ik focusde tijdens dit vak meer op de back-end, het filteren en het kennis ophalen van blok-tech dat ik eerder heb gevolgd. Naast mijn gezellige teamgenoten, de fijne werksfeer, verbaasde mijn eigen gedrag me een beetje. Ik nam best veel initatief, ook op het gebied van communicatie, en het ideeën meegeven aan teamgenoten over hoe ze bepaalde dingen konden oplossen. Dit heeft me geholpen zowel meer comfortabel te worden in de back-end, en hielp te realiseren dat in een team werken, niet alleen gezelliger was, maar ik op de een of andere manier ook beter ging presteren. Het enige nadeel was, was dat ik niet echt CSS schreef en heb nagedacht over het concept, iets waar ik wel meer ervaring in had kunnen gebruiken."
    },
 {
        "id": "HCD",
        "name": "Human Centered Design",
        "description": [
"Roger studeert filosofie en hij wil graag annotaties kunnen maken in de (digitale) boeken die hij leest, en die annotaties makkelijk terug kunnen vinden.",
"Roger heeft maculadegeneratie. Hij kan steeds slechter zien en is nu op het punt dat hij echt niet meer zonder screen reader kan."
        ],
        "reflection": "Human Centered Design was een vak waar ik veel van heb geleerd, maar ook veel van had kunnen leren. Het was een vak waar ik niet echt mijn creativiteit in kwijt kon, en dat vond ik jammer. Het was voornamelijk onderzoek doen naar de doelgroep, en daar een concept voor maken. Dit is iets wat ik niet heel leuk vind, maar wel belangrijk is. Het heeft me geholpen om te begrijpen dat het belangrijk is om de gebruiker centraal te stellen, en dat je niet zomaar iets kan maken zonder na te denken over wie het gaat gebruiken. Het was ook een vak waar ik veel heb geleerd over toegankelijkheid, en hoe belangrijk het is om daar rekening mee te houden bij het ontwerpen van een website."
    },
{
        "id": "API",
        "name": "API",
        "description": [
"In dit vak zullen we een van de meest voorkomende app-concepten van vandaag gebruiken en ontdekken dat we deze kunnen maken met moderne webtechnologie met als doel om een rijke gebruikerservaring creëeren.",
"De randvoorwaarden zijn: minimaal een overzichts- en detailpagina, gebouwd in TinyHTTP + Liquid, minimaal een content API, minimaal twee Web API's"
        ],
        "reflection": "API was een van mijn favoriete vakken van de minor. Het lag iets meer aan de technische kant, met templating en het oproepen van data vanuit de API. Op die manier puzzelen vond ik erg leuk en interessant, iets wat ik bij sommige andere vakken zoals HCD minder kon doen en ook minder leuk vond. Met behulp van Declan werd ik ook steeds beter in het dynamisch schrijven, het gebruik van queries, en hoe je het beste een probleem kunt vinden en oplossen als data niet werkt. Dit is iets wat later tijdens de meesterproef erg veel naar voren kwam. Voor het probleem vinden, dus vanaf waar precies gaat het mis? Niet alleen het einde, maar misschien gaat bij het eerste gedeelte van de data ophalen het al mis. Dit is een van de redenen dat ik API toch wel samen met Browser Technologies als mijn favoriete vakken beschouw."
    }
]